Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_l3gd20h.h
//*****************************************************************************
//
// The following are defines for the bit fields in the L3GD20H_O_IG_DURATION
// register.
//
//*****************************************************************************
#define L3GD20H_IG_DURATION_WAIT_M                                            \
                                0x80        // If WAIT is enabled then DURATION
                                            // samples must occur before
                                            // asserting the interrupt.
#define L3GD20H_IG_DURATION_WAIT_DIS                                          \
                                0x00
#define L3GD20H_IG_DURATION_WAIT_EN                                           \
                                0x80
#define L3GD20H_IG_DURATION_DURATION_M                                        \
                                0x7F        // Duration D[6-0]
#define L3GD20H_IG_DURATION_DURATION_S                                        \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the L3GD20H_O_LOW_ODR
// register.
//
//*****************************************************************************
#define L3GD20H_LOW_ODR_DRDY_HL_M                                             \
                                0x20        // DRDY/INT2 active level
#define L3GD20H_LOW_ODR_DRDY_HL_ACTIVE_LOW                                    \
                                0x00
#define L3GD20H_LOW_ODR_DRDY_HL_ACTIVE_HIGH                                   \
                                0x20
#define L3GD20H_LOW_ODR_I2C_DISABLE_M                                         \
                                0x08        // disable I2C interface
#define L3GD20H_LOW_ODR_I2C_DISABLE_BOTH                                      \
                                0x00
#define L3GD20H_LOW_ODR_I2C_DISABLE_SPI_ONLY                                  \
                                0x08
#define L3GD20H_LOW_ODR_SWRESET_M                                             \
                                0x04        // software reset
#define L3GD20H_LOW_ODR_SWRESET_NORMAL                                        \
                                0x00
#define L3GD20H_LOW_ODR_SWRESET_RESET                                         \
                                0x04
#define L3GD20H_LOW_ODR_DATARATE_M                                            \
                                0x01        // Low-speed data rate enable;
                                            // default value: 0
#define L3GD20H_LOW_ODR_DATARATE_HIGH                                         \
                                0x00
#define L3GD20H_LOW_ODR_DATARATE_LOW                                          \
                                0x01

#endif // __SENSORLIB_HW_L3GD20H_H__
